
/******************************头文件加载与宏定义**************************************************/
#include <reg52.h>                 
																		/*用于声明特殊功能寄存器的名称.
																			如果没有这个头文件，特殊功能寄存器，只能用硬件的地址进行读写操作。*/

typedef  unsigned int uint;
typedef  unsigned char uchar;
/******************************声明全局函数和变量*********************************************************/
/*此处增加其它全局声明*/

				

/**************************************主函数*************************************************/
void main()
{
	/*C51所有变量声明必须在代码段前*/
	
	
	/*此处增加其它局部声明*/
	
/************************************定时器初始化***************************************************/
	
	TMOD=0x11;		/*0000 0001   TMOD 是计时器工作方式寄存器,有8位
	
									高四位设置定时器1.低四位定时器0. 两者设置相同.
									
									低四位0001 
									低两位01 代表方式1:16位寄存器
									{00	代表方式0:13位寄存器(高8,低5).
									10	代表方式3:8位自动重装定时:高8位溢出后,	
									低8位数值自动装入高8位做为初值.
									11	代表方式4:分为两个单独的8位定时/计数器}. 
									最高位0代表:GATE位(0不受中断控制,1受中断控制),
									第二位代表:CT位(选择0为定时器,选择1为计数器)*/
	/*********************************定时器加载初值******************************************************/
	
	TH0=(65536-1000)/256;	/*定时器0是由两个8位寄存器TH0与TL0组成,
							  定时器初值计算方法为65536减去定时间隔除以256放入高8位,*/
	TL0=(65536-1000)%256;	/*再用65536减去定时间隔取余256放入低8位*/
	
	TH1=(65536-1000)/256;
	
	TL1=(65536-1000)%256;
	/**********************************开中断*****************************************************/
	
	EA=1;	//开总中断
	ET0=1; //开定时器0中断
	TR0=1;	//启动定时器0
	ET1=1;	//开定时器1中断
	TR1=1;	//启动定时器1
	
	EX0=1;   //开外部中断0
	IT0=1;	//设置中断方式为下降沿.
	
	/***************************************************************************************/

}