/*本程序做为单片机时钟的控制程序.*/


/******************************头文件加载与宏定义**************************************************/
#include <reg52.h>                 
																		/*用于声明特殊功能寄存器的名称.
																			如果没有这个头文件，特殊功能寄存器，只能用硬件的地址进行读写操作。*/

typedef  unsigned int uint;
typedef  unsigned char uchar;
/******************************声明全局函数和变量*********************************************************/
/*此处增加其它全局声明*/

sbit intx=P3^2;


/**************************************主函数*************************************************/
void main()
{
	/*C51所有变量声明必须在代码段前*/
	
	
	/*此处增加其它局部声明*/
	

	/**********************************开中断*****************************************************/
	
	EA=1;	//开总中断
	EX0=1;   //开外部中断0
	IT0=1;	//设置中断方式为下降沿.
	//intx=0;
	P0=0;
	while(1);

}
void init0() interrupt 0
{
	//intx=0;
	P0=0xff;
}